{"app_name":"Tourist Guide","app_version":"1.0.0","app_content":"is a platform that helps travelers discover cities, find events, and book hotels. We aggregate curated listings, real attendee insights, and up-to-date availability to make trip planning simple and secure.","app_phone_number":"0598548436","usage_treaty":"1. Acceptance of Terms\r\nBy creating an account or using [Tourist Guide], you accept these terms and our Usage Policy and Privacy Policy. If you do not agree, do not use the service.\r\n\r\n2. Eligibility and Account\r\n•  You must be at least 18 or the age of majority in your jurisdiction.\r\n•  Provide accurate information and keep your credentials secure.\r\n•  You are responsible for all activity on your account.\r\n3. Services and Bookings\r\n•  [Tourist Guide] provides a platform to explore events and hotels and, where available, complete bookings.\r\n•  Some listings are managed by third-party providers. Their terms, policies, and restrictions may apply.\r\n•  Availability, pricing, and descriptions may change, and errors may be corrected.\r\n4. Pricing, Payments, Taxes\r\n•  Prices may be displayed in local currency and can vary by date and demand.\r\n•  You authorize [APP_NAME] or its payment processor to charge your selected payment method.\r\n•  You are responsible for any applicable taxes or fees.\r\n5. Cancellations, Changes, Refunds\r\n•  Cancellation and refund terms depend on the specific event or hotel and are stated at checkout.\r\n•  Where [Tourist Guide] is the merchant of record, refunds (if applicable) will be processed to the original payment method within [REFUND_WINDOW_DAYS] days, subject to policy and law.\r\n•  No-shows or late cancellations may be non-refundable.\r\n6. User Content and Conduct\r\n•  You grant [APP_NAME] a non-exclusive, worldwide license to host, display, and use content you submit to operate the service.\r\n•  You will not post unlawful, infringing, deceptive, or harmful content (see Usage Policy).\r\n7. Intellectual Property\r\n•  The platform, including logos, designs, and software, is owned by [COMPANY_NAME] and protected by law.\r\n•  Do not copy, modify, reverse-engineer, or exploit the service except as permitted.\r\n8. Third-Party Services\r\n•  We may link to third-party services. We are not responsible for their content, policies, or practices.\r\n9. Disclaimers\r\n•  The service is provided “as is” and “as available.” We do not guarantee uninterrupted, secure, or error-free operation, or the accuracy of listings.\r\n10. Limitation of Liability\r\n•  To the fullest extent permitted by law, [Tourist Guide] will not be liable for indirect, incidental, special, or consequential damages, or for lost profits or data.\r\n11. Indemnification\r\n•  You agree to indemnify and hold harmless [Tourist Guide] from claims arising out of your use of the service or violation of these terms.\r\n12. Termination\r\n•  We may suspend or terminate access for any violation of these terms or legal requirements.\r\n13. Governing Law and Dispute Resolution\r\n•  This Agreement is governed by the laws of [127.0.0.1], without regard to conflicts of laws.\r\n•  Disputes will be resolved in the courts of [127.0.0.1] unless otherwise required by law.\r\n14. Changes to Terms\r\n•  We may update these terms. Continued use after changes constitutes acceptance.\r\n15. Contact\r\n•  Email: [admin@touristguide.com]\r\n•  Address: [127.0.0.1]","usage_policy":"1. Prohibited Activities\r\nYou may not:\r\n•  Use the service for any unlawful purpose or to violate any law or regulation.\r\n•  Post or transmit content that is illegal, defamatory, fraudulent, infringing, obscene, hateful, harassing, or otherwise harmful.\r\n•  Impersonate any person or entity, or misrepresent your affiliation.\r\n•  Attempt to gain unauthorized access, probe or test vulnerabilities, or circumvent security.\r\n•  Introduce malware, bots, or automated scraping tools without explicit permission.\r\n•  Copy, mirror, or harvest data at scale, or use the platform for competitive analysis contrary to fair use.\r\n•  Interfere with service availability (e.g., DDoS, rate abuse, or excessive requests).\r\n•  Resell access or use the service for commercial timesharing without authorization.\r\n2. Data and Privacy\r\n•  Only collect or process personal data as allowed by applicable law and our Privacy Policy.\r\n•  Do not attempt to de-anonymize or re-identify data.\r\n3. Reviews and Content\r\n•  Reviews must be truthful and based on genuine experiences.\r\n•  Do not offer or accept compensation for reviews.\r\n4. Security\r\n•  Keep your account credentials secure.\r\n•  Report suspected security issues to [admin@touristguide.com] immediately.\r\n5. Enforcement\r\n•  Violations may result in warnings, suspension, termination, or legal action.","laws_review":"1. Consumer Protection and E-Commerce\r\n•  We display prices, fees, and material terms clearly before purchase.\r\n•  We honor disclosed cancellation and refund terms and applicable consumer rights.\r\n2. Privacy and Data Protection\r\n•  We collect and process personal data in accordance with applicable laws (e.g., GDPR, CCPA) where relevant.\r\n•  Users may request access, correction, or deletion as required by law. Contact: [CONTACT_EMAIL].\r\n3. Payments and Financial Compliance\r\n•  Payments are processed via PCI-DSS compliant providers.\r\n•  We do not store full payment card data on our servers.\r\n4. Content and IP\r\n•  We respect intellectual property rights and respond to valid takedown requests.\r\n•  Users must have rights to content they upload.\r\n5. Accessibility\r\n•  We strive to improve accessibility and consider WCAG guidelines where feasible.\r\n6. Children and Age Restrictions\r\n•  The service is intended for adults (18+ or the age of majority in their jurisdiction).\r\n7. Anti-Spam and Communications\r\n•  We obtain required consent for marketing communications and provide opt-out controls.\r\n8. Data Security and Retention\r\n•  We implement reasonable technical and organizational measures.\r\n•  Data is retained only as necessary for the purposes stated or as required by law.\r\n9. Export Controls and Sanctions\r\n•  We do not provide services in violation of applicable export control or sanctions regimes.\r\n10. Taxes and Local Regulations\r\n•  Where applicable, we collect or display taxes and comply with local rules for lodging and events.\r\n11. Dispute Resolution and Jurisdiction\r\n•  Disputes are governed by the laws of [JURISDICTION]. Venue and process are described in our Terms of Use.\r\n12. Changes to this Statement\r\n•  We may update this statement to reflect legal or operational changes."}